print("Вітаємо вас в нашому магазині!❤️")

products = {
    "яблуко звичайне": 10,
    "банан": 13,
    "груша": 12,
    "мандарин": 15,
    "ананас": 18,
    "апельсин": 13,
    "арбуз": 17,
    "лимон": 14,
    "лайм": 16,
    "диня": 18,
    "малина": 17,
    "полуниця": 17,
    "лохина": 21,
    "чорниця": 19,
    "огірок": 10,
    "помідор": 12,
    "морква": 9,
    "капуста": 12,
    "шалата": 14,
    "помідор чері": 15,
    "редиска": 13,
    "буряк": 11,
    "драконячий фрукт": 27,
    "кокос": 22,
    "помело": 20,
    "світі": 22,
    "грейпфрукт": 19,
    "вишня": 18,
    "черешня": 18,
    "яблуко голд": 12,
    "молоко 2.5%": 17,
    "молоко 4.5%": 17,
    "молоко 0%": 17,
}

course= {
    "$": 42.96 ,
    "€": 50.90 ,
    "£": 58.81 ,
}

cart = {}
total = 0

while True:
    name = input("Товар (або 'стоп'): ").lower()

    if name == "стоп":
        break

    if name in products:
        qty = int(input("Кількість: "))
        cart[name] = cart.get(name, 0) + qty
        total += products[name] * qty
        print("✔ Додано")
    else:
        print("✖ Такого товару нема")
currency=input("В яку сумму ковертувати? $ або € або £:")
res = round(total / course [currency], 2)
print("\n" + "-" * 30)
print("🧾        ЧЕК")
print("-" * 30)

for item, qty in cart.items():
    price = products[item]
    sum_item = price * qty
    print(f"{item.capitalize():10} {qty} x {price} = {sum_item} грн")

print("-" * 30)

# Вивід суми в гривнях і в обраній валюті
print(f"РАЗОМ: {total}₴ / {res} {currency}")

print("Дякуємо за покупку ❤️")
print("-" * 30)
